app/controllers/every_pays_controller.rb

SELECT "every_pays".* FROM "every_pays"
---
  def index
    @every_pays = EveryPay.all

INSERT INTO "every_pays" ("status", "amount", "payment_reference", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["status", "success"], ["amount", "10"], ["payment_reference", "test21gfgf7df"], ["created_at", "2021-11-29 07:15:02.197098"], ["updated_at", "2021-11-29 07:15:02.197098"]]
---
  def payment_success

    gateway = ActiveMerchant::Billing::EveryPayGateway.new(
              api_username: "22a8a6b1324144b0",
              api_secret: "8260872fe1b2b30d1753f3d360cf6e83",
              account_name: "EUR3D1",
              gateway_url: "https://igw-demo.every-pay.com/api/v4",
              # customer_url: "http://localhost:3000/paid"
              customer_url: "http://example.com/paid"
            )
    payment_response = gateway.result(payment_reference: params[:payment_reference])
    EveryPay.create status: payment_response.params['success']? 'success' : 'pending' ,amount: payment_response.params['initial_amount'] , payment_reference: params[:payment_reference]