app/controllers/stripe_payments_controller.rb

SELECT "stripe_payments".* FROM "stripe_payments"
---
  def index
    @stripe_payments = StripePayment.all

INSERT INTO "stripe_payments" ("customer_id", "amount", "status", "created_at", "updated_at", "response") VALUES (?, ?, ?, ?, ?, ?)
---
      if response_data.status == 'succeeded'
        # redirect_url='here'
        charge_data = Stripe::Charge.retrieve(response_data.id,)
        StripePayment.create status: response_data.status, response: charge_data ,amount: response_data.amount/100,customer_id: customer.id

INSERT INTO "stripe_payments" ("customer_id", "amount", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["customer_id", 0.0], ["amount", "20"], ["status", "50"], ["created_at", "2021-11-24 13:20:51.125809"], ["updated_at", "2021-11-24 13:20:51.125809"]]
---
  def create
    @stripe_payment = StripePayment.new(stripe_payment_params)

    respond_to do |format|
      if @stripe_payment.save

UPDATE "stripe_payments" SET "customer_id" = ?, "updated_at" = ? WHERE "stripe_payments"."id" = ?  [["customer_id", 0.0], ["updated_at", "2021-11-24 13:21:08.628690"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @stripe_payment.update(stripe_payment_params)

DELETE FROM "stripe_payments" WHERE "stripe_payments"."id" = ?  [["id", 1]]
---
  def destroy
    @stripe_payment.destroy

SELECT "stripe_payments".* FROM "stripe_payments" WHERE "stripe_payments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_stripe_payment
      @stripe_payment = StripePayment.find(params[:id])